views/owner/view.php

    ]) ?>
    <div class="">
        <?php
        $petnames = PetName::find()->where(['ownerId' => $id])->all();
---
SELECT * FROM `pet_name` WHERE `ownerId`='5'

        echo "<ul>";
            foreach ( $petnames  as  $petname ){
                echo "<li>";
                        $pets = Pet::find()->where(['nameId' => $petname])->all();
---
SELECT * FROM `pet` WHERE `nameId` IN (13, '13 собака', 5)