views/admin/super_admin.php

<p class="superadmin">Перейти в админку клуба</p>

<?php
$clubs = Club::find()->all();
---
SELECT * FROM `club`