views/pet/_form.php

SELECT * FROM `breed`
---
    <div class="row">
        <div class="col-md-6">
            <?php
            $breed = Breed::find()->all();

SELECT * FROM `color`
---
            echo $form->field($model, 'breed')->dropDownList($items,$params);
            ?>
            <?php
            $color = Color::find()->all();