views/pet/index.php

                <tr><th>Порода</th><th>Кличка</th><th>Окрас</th><th>Пол</th><th>ПІБ власника</th><th>Подивитись</th><th>Змінити</th></tr>";
                foreach ($pets as $pet) {
                    $id = $pet['nameId'];
                    $petname = PetName::findOne($id);
                    $owner = Owner::findOne($petname['ownerId']);
---
SELECT * FROM `pet_name` WHERE `id`='44'
SELECT * FROM `owner` WHERE `id`=15