controllers/OwnerController.php

INSERT INTO `owner` (`last_name`, `first_name`, `middle_name`, `adres_index`, `city`, `street`, `house`, `flat`, `phone_home`, `phone_work`, `email`, `site`, `date_of_entry`, `cipher_in_the_breeding_factory`, `KSU_code`, `petsId`, `comments`) VALUES ('Второй', 'Сергей', 'Васильевич', 112345, 'Харьков', 'Монако', 2, 23, '234565', '23456789', 'фыва', 'ывнп', '11.11.2019', '23', '33', 4454, '<p>дцыкопрфкари</p>\r\n')
SELECT * FROM `owner` WHERE `id`='1'
---
    public function actionCreate($clubId)
    {
        $model = new Owner();
        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            $model->image = UploadedFile::getInstance($model, 'image');
            if($model->image){
                $model->upload();
            }

            $model->gallery = UploadedFile::getInstances($model, 'gallery');
            $model->uploadGallery();

            Yii::$app->session->setFlash('success', "Профіль {$model->last_name} додан");
            return $this->redirect(['view', 'id' => $model->id, 'clubId' => $clubId]);
        }

        return $this->render('create', [
            'model' => $model,
            'clubId' => $clubId,
        ]);
    }
   /* public function actionPetName($id)
    {
        $owner = Owner::findOne($id);

SELECT * FROM `owner` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = Owner::findOne($id)) !== null) {