controllers/PetController.php

SELECT * FROM `pet` WHERE `clubId`='2'
---
    public function actionIndex($clubId)
    {
        /*if (!Yii::$app->user->can('viewSuperAdminPage')) {
            throw new ForbiddenHttpException('Доступ заборонено');
        }*/
        $pets = Pet::find()->where(['clubId' => $clubId])->asArray()->all();

SELECT * FROM `image` WHERE `itemId`='12'
SELECT * FROM `pet_name` WHERE `id`=22
---
    public function actionView($id)
    {
        $images = Image::find()->where(['itemId' => $id])->all();
        $model = $this->findModel($id);
        $clubId = $model['clubId'];
        $nameId = $model->nameId;
        $ownerId = $model['ownerId'];
        $owner = Owner::findOne($ownerId);
        $petname = PetName::find()->where(['id' => $nameId])->asArray()->all();

INSERT INTO `pet` (`breed`, `color`, `gender`, `dob`, `nameId`, `pedigree_number`, `number_KSU`, `number_FCI`, `registration_club`, `breeding_club`, `comments`, `father`, `mother`, `dignityId`, `awardsId`, `puppy_card_number`, `participation_in_the_exhibition`) VALUES ('Овчарка', 'Черный', 'Кобель', '2019-12-30', 22, 1, 1, 1, '1', '1', 'фыарыапоыапо', 1, 1, 1, 1, 1, 1)
---
    public function actionCreateName($id, $clubId){
        $model = new PetName();
        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `pet` WHERE `id`='12'
---
    public function actionDelete($id)
    {
            $model = Pet::findOne($id);
            $clubId = $model['clubId'];
            $idName = PetName::findOne($model['nameId'])->delete();