controllers/PetController.php

SELECT * FROM `pet_name`
---
    public function actionIndex()
    {/*
        $pets = Pet::find()->asArray()->all();

        $petname = PetName::find()->asArray()->all();