controllers/PetController.php

    protected function findModel($id)
    {
        if (($model = Pet::findOne($id)) !== null) {
---
SELECT * FROM `pet` WHERE `id`='4'