controllers/PetsController.php

    public function actionCreate()
    {
        $model = new Pets();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `pets` (`breedId`, `name`, `colorId`, `ownerId`, `dob`, `genderId`, `pedigree_number`, `number_KSU`, `number_FCI`, `registration_club`, `breeding_club`, `comments`, `father`, `mother`, `dignityId`, `awardsId`, `puppy_card_number`, `participation_in_the_exhibition`) VALUES (2, 'Сашка', 2, 3, '11.11.2019', 1, 1, 1, 1, '1', '1', 'Пробный шар', 1, 2, 3, 2, 1, 1)

    protected function findModel($id)
    {
        if (($model = Pets::findOne($id)) !== null) {
---
SELECT * FROM `pets` WHERE `id`='1'