controllers/SiteController.php

    public function actionOwners()
    {
        $this->layout = 'main';

        $owners = Owner::find()->all();
        $images = Image::find()->all();
---
SELECT * FROM `owner`
SELECT * FROM `image`