views/site/owners.php

        <a href="<?= \yii\helpers\Url::to(['site/view-player', 'id' => $owner['id'], 'modelName'=> 'Owner'])?>">
            <div class="col-md-4 player">
                <?php
                $images = Image::find()->where(['itemId'=> $owner['id'], 'modelName'=> 'Owner'])->all();
---
SELECT * FROM `image` WHERE (`itemId`=1) AND (`modelName`='Players')